app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "Sdescription", "Ldescription", "btnName", "btnUrl", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "btnUrl" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["btnUrl", "http://i.imgur.com/uJfwO.gif"], ["updated_at", "2015-11-03 16:02:59.843249"], ["id", 10]]